#+ Emacs Notes

** Source Code

#+begin_src clojure

  (+ 2 2)

#+end_src

#+RESULTS:
: 4

#+begin_src lua :results output 

  function greeting()
      print "Hello World, this is a Lua inside Emacs!"
  end

  greeting()

#+end_src

#+RESULTS:
: Hello World, this is a Lua inside Emacs!

#+begin_src js :results output 

  const greeting = () => {
    console.log("Hello World, this is a Javascript inside Emacs!")
  }

  greeting()

#+end_src

#+RESULTS:
: Hello World, this is a Lua inside Emacs!

#+begin_src emacs-lisp

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (lua . t)
     (js . t)
     (clojure .t)
     ))

  (setq org-confirm-babel-evaluate nil)

#+end_src

#+RESULTS:

** Structure Templates

With these entries added to list you can type `<el` and press Tab. It will automatically create an emacs-lisp source block.

#+begin_src emacs-lisp

  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("lu" . "src lua"))
  (add-to-list 'org-structure-template-alist '("js" . "src js"))
  (add-to-list 'org-structure-template-alist '("cl" . "src clojure"))

#+end_src

#+RESULTS:
: ((lu . src lua) (js . src js) (sql . src sql) (rb . src ruby) (py . src python) (cl . src clojure) (el . src emacs-lisp) (sh . src shell) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))


